Revit 2024 API
ExportDGNSettings.ListNames Method
 Returns a list of names of dgn export settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static IList<string> ListNames(
	Document aDoc
)
Visual Basic
Public Shared Function ListNames ( _
	aDoc As Document _
) As IList(Of String)
Visual C++
public:
static IList<String^>^ ListNames(
	Document^ aDoc
)
Parameters
aDoc
Type: Autodesk.Revit.DB.Document
 A Revit document to retrieve names from
Return Value
 An array of strings representing names of predefined setups.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExportDGNSettings Class
Autodesk.Revit.DB Namespace